In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [3]:
dataset

{'Departman': ['Bilişim',
  'İnsan Kaynakları',
  'Üretim',
  'Üretim',
  'Bilişim',
  'İnsan Kaynakları'],
 'Çalışan': ['Mustafa', 'Jale', 'Kadir', 'Zeynep', 'Murat', 'Ahmet'],
 'Maaş': [3000, 3500, 2500, 4500, 4000, 2000]}

In [4]:
df = pd.DataFrame(dataset)

In [5]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [6]:
DepGroup = df.groupby("Departman")

In [7]:
DepGroup

In [8]:
DepGroup = df.groupby("Departman")

In [9]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [11]:
DepGroup.sum().loc["Üretim"]

Maaş    7000
Name: Üretim, dtype: int64

In [12]:
int(DepGroup.sum().loc["Üretim"])

7000

In [13]:
df.groupby("Departman").count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [14]:
df.groupby("Departman").max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [20]:
df.groupby("Departman").max()["Maaş" ]

Departman
Bilişim             4000
Üretim              4500
İnsan Kaynakları    3500
Name: Maaş, dtype: int64

In [21]:
df.groupby("Departman").count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [22]:
df.groupby("Departman").max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [26]:
minPriceB = df.groupby("Departman").min()["Maaş"]["Bilişim"]

In [24]:
minPriceB

3000

In [28]:
df.groupby("Departman").mean()

                  Maaş
Departman
Bilişim           3500
Üretim            3500
İnsan Kaynakları  2750

In [29]:
df.groupby("Departman").mean().loc["Bilişim"]["Maaş"]

3500